app/Controllers/Admin.php

    public function delete()
    {
        if($this->request->getMethod() != "POST") throw new \Exception('Metode tidak didukung');
        $req = $this->request->getPost();
        $db = \Config\Database::connect();
        try {
            $success = $db->table('Produk')->where('id_produk', $req['id_produk'])->delete();
---
DELETE FROM `Produk`
WHERE `id_produk` = '84'

    public function update()
    {
        if($this->request->getMethod() != "POST") throw new \Exception('Metode tidak didukung');
        $req = $this->request->getPost();
        $db      = \Config\Database::connect();
        try {
            $newVal = [
                'nama_produk' => $req['nama_produk'],
                'harga' => $req['harga'],
                'status_id' => $req['status_id'],
                'kategori_id' => $req['kategori_id']
            ];
            $success = $db->table('Produk')->where('id_produk', $req['id_produk'])->update($newVal);
---
UPDATE `Produk` SET `nama_produk` = 'cinta', `harga` = '1234', `status_id` = '1', `kategori_id` = '1'
WHERE `id_produk` = '82'

    public function get_products()
    {
        $db      = \Config\Database::connect();
        $data = $db->table('Produk')->select('*')->join('Kategori', 'Kategori.id_kategori = Produk.kategori_id')->join('Status', 'Status.id_status = Produk.status_id')->get()->getResult();
---
SELECT *
FROM `Produk`
JOIN `Kategori` ON `Kategori`.`id_kategori` = `Produk`.`kategori_id`
JOIN `Status` ON `Status`.`id_status` = `Produk`.`status_id`

    public function get_categories()
    {
        $db      = \Config\Database::connect();
        $data = $db->table('Kategori')->get()->getResult();
---
SELECT *
FROM `Kategori`

    public function get_status()
    {
        $db      = \Config\Database::connect();
        $data = $db->table('Status')->get()->getResult();
---
SELECT *
FROM `Status`