app/Controllers/Home.php

    public function index()
    {
        $db      = \Config\Database::connect();
        $data = $db->table('Produk')->where('status_id', '1')->get()->getResult();
---
SELECT *
FROM `Produk`
WHERE `status_id` = '1'